In [1]:
!conda install -c anaconda lxml --yes

Solving environment: done


==> WARNING: A newer version of conda exists. <==
  current version: 4.5.11
  latest version: 4.7.12

Please update conda by running

    $ conda update -n base -c defaults conda



## Package Plan ##

  environment location: /home/jupyterlab/conda/envs/python

  added / updated specs:
    - lxml


The following packages will be downloaded:

    package                    |            build
    ---------------------------|-----------------
    openssl-1.1.1              |       h7b6447c_0         5.0 MB  anaconda
    certifi-2019.9.11          |           py36_0         154 KB  anaconda
    lxml-4.3.0                 |   py36hefd8a0e_0         1.5 MB  anaconda
    ------------------------------------------------------------
                                           Total:         6.7 MB

The following packages will be UPDATED:

    certifi: 2019.9.11-py36_0     conda-forge --> 2019.9.11-py36_0     anaconda
    lxml:    4.2.5-py37hefd8a0e_0             --> 4.3.0-py36hefd8a0e_0 anaconda
    openssl: 1.1.1c-h516909a_0    conda-forge --> 1.1.1-h7b6447c_0     anaconda


Downloading and Extracting Packages
openssl-1.1.1        | 5.0 MB    | ##################################### | 100%
certifi-2019.9.11    | 154 KB    | ##################################### | 100%
lxml-4.3.0           | 1.5 MB    | ##################################### | 100%
Preparing transaction: done
Verifying transaction: done
Executing transaction: done

In [2]:
import pandas as pd
import numpy as np
from sklearn.tree import DecisionTreeClassifier
from sklearn import preprocessing
import lxml
#from bs4 import BeautifulSoup

In [24]:
!conda install -c anaconda BeautifulSoup --yes

Solving environment: failed

PackagesNotFoundError: The following packages are not available from current channels:

  - beautifulsoup

Current channels:

  - https://conda.anaconda.org/anaconda/linux-64
  - https://conda.anaconda.org/anaconda/noarch
  - https://repo.anaconda.com/pkgs/main/linux-64
  - https://repo.anaconda.com/pkgs/main/noarch
  - https://repo.anaconda.com/pkgs/free/linux-64
  - https://repo.anaconda.com/pkgs/free/noarch
  - https://repo.anaconda.com/pkgs/r/linux-64
  - https://repo.anaconda.com/pkgs/r/noarch
  - https://repo.anaconda.com/pkgs/pro/linux-64
  - https://repo.anaconda.com/pkgs/pro/noarch

To search for alternate channels that may provide the conda package you're
looking for, navigate to

    https://anaconda.org

and use the search bar at the top of the page.

In [3]:
df_titanic = pd.read_csv('titanic.csv', index_col='PassengerId')
#df_titanic.head()
df_titanic[:5]

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
df_titanic['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [5]:
df_titanic.to_csv('t.csv')

In [6]:
df_titanic.groupby('Survived').size() / len(df_titanic)

Survived
0    0.616162
1    0.383838
dtype: float64

In [7]:
df_titanic['Survived'].value_counts() / len(df_titanic)

0    0.616162
1    0.383838
Name: Survived, dtype: float64

In [8]:
df_titanic['Pclass'].value_counts() / len(df_titanic)

3    0.551066
1    0.242424
2    0.206510
Name: Pclass, dtype: float64

In [9]:
df_titanic['Age'].describe()

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: Age, dtype: float64

In [10]:
df_titanic.corr(method = 'pearson')

          Survived    Pclass       Age     SibSp     Parch      Fare
Survived  1.000000 -0.338481 -0.077221 -0.035322  0.081629  0.257307
Pclass   -0.338481  1.000000 -0.369226  0.083081  0.018443 -0.549500
Age      -0.077221 -0.369226  1.000000 -0.308247 -0.189119  0.096067
SibSp    -0.035322  0.083081 -0.308247  1.000000  0.414838  0.159651
Parch     0.081629  0.018443 -0.189119  0.414838  1.000000  0.216225
Fare      0.257307 -0.549500  0.096067  0.159651  0.216225  1.000000

In [11]:
df_titanic['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [12]:
df_female = pd.DataFrame(df_titanic['Name'].loc[df_titanic['Sex'] == 'female'])
df_female

                                                          Name
PassengerId
2            Cumings, Mrs. John Bradley (Florence Briggs Th...
3                                       Heikkinen, Miss. Laina
4                 Futrelle, Mrs. Jacques Heath (Lily May Peel)
9            Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
10                         Nasser, Mrs. Nicholas (Adele Achem)
...                                                        ...
881               Shelley, Mrs. William (Imanita Parrish Hall)
883                               Dahlberg, Miss. Gerda Ulrika
886                       Rice, Mrs. William (Margaret Norton)
888                               Graham, Miss. Margaret Edith
889                   Johnston, Miss. Catherine Helen "Carrie"

[314 rows x 1 columns]

In [13]:
#создание новых данных, из строк столбца Name, которым соответствует значение female в столбце Sex
df_female = pd.DataFrame(df_titanic['Name'].loc[df_titanic['Sex'] == 'female'])
#создание столбца, где женские имена идут в скобках после имени мужа
df_female['first_name_1'] = df_female.Name.str.extract(r'[\(](\w+)',expand=False)
#создание столбца, где женские имена идут после Miss.
df_female['first_name_2'] = df_female.Name.str.extract(r'(Miss\.\s\w+)',expand=False)
#удаление Miss.
df_female['first_name_2'] = df_female.first_name_2.str.replace('(Miss.\s)','')
df_female.head()

,Name,first_name_1,first_name_2
PassengerId,,,
2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",Florence,NaN
3,"Heikkinen, Miss. Laina",NaN,Laina
4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",Lily,NaN
9,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",Elisabeth,NaN
10,"Nasser, Mrs. Nicholas (Adele Achem)",Adele,NaN

In [14]:
#создание столбца, который объдинит значение не NaN
df_female['first_name'] = df_female[['first_name_1', 'first_name_2']].fillna('').sum(axis=1)
#df_female['first_name'] = df_female['first_name_1'].fillna('') + df_female['first_name_2'].fillna('')
df_female['first_name'].value_counts().head(15)

Anna         15
Mary         14
Elizabeth    11
Margaret     10
              8
Alice         6
Maria         5
Helen         5
Bertha        5
Catherine     4
Annie         4
Ellen         4
Emily         4
Marie         4
Marion        4
Name: first_name, dtype: int64

In [15]:
#оказалось, что не все случаи подходят под эти два правила
zero = df_female['first_name'] == ''
zero.value_counts()

False    306
True       8
Name: first_name, dtype: int64

In [16]:
#смотрим какие имена не подходят под эти правила
df_female['Name'].loc[df_female['first_name'] == '']

PassengerId
20                              Masselmani, Mrs. Fatima
257                      Thorne, Mrs. Gertrude Maybelle
370                       Aubart, Mme. Leontine Pauline
444                           Reynaldo, Ms. Encarnacion
642                                Sagesser, Mlle. Emma
707                       Kelly, Mrs. Florence "Fannie"
711    Mayne, Mlle. Berthe Antonine ("Mrs de Villiers")
798                                    Osman, Mrs. Mara
Name: Name, dtype: object

In [17]:
df_tit_tree = df_titanic[['Pclass', 'Age', 'Parch', 'Fare', 'Sex', 'Survived']]
df_tit_tree
df_tit_tree['Sex'] = pd.get_dummies(df_tit_tree['Sex'])
#df_tit_tree.dropna(subset=["Age"], axis=0, inplace=True)
#X = df_tit_tree.values
#X[0:5]

/home/jupyterlab/conda/envs/python/lib/python3.6/site-packages/ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  This is separate from the ipykernel package so we can avoid doing imports until

In [18]:
# создание данных, где пропущенные значения NaN
missing_data = df_tit_tree.isnull()
# вывод в каких столбцах есть пропущенные данные
for column in missing_data.columns.values.tolist(): # присвоение column названия столбца (columns.values.tolist(), возвращает список столбцов)
    print(column) 
    print (missing_data[column].value_counts())
    print("")

Pclass
False    891
Name: Pclass, dtype: int64

Age
False    714
True     177
Name: Age, dtype: int64

Parch
False    891
Name: Parch, dtype: int64

Fare
False    891
Name: Fare, dtype: int64

Sex
False    891
Name: Sex, dtype: int64

Survived
False    891
Name: Survived, dtype: int64

In [19]:
df_tit_tree.dropna(subset=["Age"], axis=0, inplace=True)
X = df_tit_tree[['Pclass', 'Age', 'Parch', 'Fare', 'Sex']].values
#X = preprocessing.StandardScaler().fit(X).transform(X)
X[0:5]

/home/jupyterlab/conda/envs/python/lib/python3.6/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

array([[ 3.    , 22.    ,  0.    ,  7.25  ,  0.    ],
       [ 1.    , 38.    ,  0.    , 71.2833,  1.    ],
       [ 3.    , 26.    ,  0.    ,  7.925 ,  1.    ],
       [ 1.    , 35.    ,  0.    , 53.1   ,  1.    ],
       [ 3.    , 35.    ,  0.    ,  8.05  ,  0.    ]])

In [20]:
y = df_tit_tree['Survived'].values
y[0:5]

array([0, 1, 1, 1, 0])

In [21]:
surv_titanic = DecisionTreeClassifier(random_state=241).fit(X, y)

In [22]:
features = ['Pclass', 'Age', 'Parch', 'Fare', 'Sex']
features_mes = list(zip(features ,surv_titanic.feature_importances_))

print(features_mes)

[('Pclass', 0.1465164353332958), ('Age', 0.2553278115854064), ('Parch', 0.024513329207931988), ('Fare', 0.27313021291512646), ('Sex', 0.3005122109582393)]